StreetCanyon-noPollutant/isothermal/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.25;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 0.25;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    topWall
    {
        type            zeroGradient;
    }
    
    floorWall
    {
        type            kqRWallFunction;
        value           uniform 0.25;
    }

    frontAndBack
    {
	type            empty;
    }
    
       
    building
    {
        type            kqRWallFunction;
        value           uniform 0.45;
    }
}


// ************************************************************************* //
